/*:
 [Previous](First-Citizen%20Object)
 
 # Imperative Programming
 
 우리가 앞으로 배울 선언형 프로그래밍을 배우기에 앞서 명령형 프로그래밍에 대해서 알아봅시다.
 
 명령형 프로그래밍은 무엇일까요?
 
 말 그대로 명령입니다. 아무것도 하지않고 있는 대상에게 그때그때마다 무엇을 어떻게(How) 해야할지 하나씩 알려주는것을 말하죠.
 
 갑자기 삼겹살이 땡기니까 간단한 삼겹살 굽기를 예로 들게요.
 
 * 냉장고에서 고기를 꺼낸다.
 * 후라이팬을 가스렌지 위에 올리고 불을 켠다.
 * 후라이팬에 고기를 올리고 10분간 굽는다.
 * 불을 끄고 고기를 후라이팬에서 꺼낸 후 먹는다.
 
 대충 써봤는데 이런 형태가 되겠네요. 이해가 어렵지 않죠?!
 
 위와같이 명령형 프로그래밍의 흐름은 친밀하고 구체화 되어있어서 이해하기가 쉽고 상태에 직접 관여하면서 연산을 하는 패러다임의 일종입니다.
 
 이해가 가셨나요? 그럼 다음장에서는 선언형 프로그래밍에 대해서 알아봅시다.

 [Next](Declarative%20Programming)
 */
