/*:
 [Previous](Imperative%20Programming)
 
 # Declarative Programming
 
 그럼 이제 선언형 프로그래밍에 대해서 알아봅시다.
 
 이전에 설명한 명령형 프로그래밍과는 전혀 다른 개념을 가지고 있는데요.
 
 어떻게 할 것인지(How)의 패러다임을 갖는 명령형 프로그래밍과는 달리 선언형 프로그래밍은 무엇을 할 것인지(What)에 대한 패러다임을 가지고 있습니다.
 
 이전에 했던 삼겹살 굽기를 예로 들어볼까요?
 
 * 삼겹살은 냉장고에 있다.
 * 삼겹살이 익는 시간은 10분이다.
 
 차이가 있죠?!
 
 물론 위와같은 선언형 프로그래밍도 올바르게 동작하기 위해서는 '후라이팬에 고기가 올라오면 불을 켠다' 같은 동작들이 추상화 되어있어야 합니다.
 
 명령형 프로그래밍은 어떻게 할 것인지에 대한 알고리즘이 명시되어 있는 반면 선언형 프로그래밍은 어떻게 할 것인지에 대한 알고리즘은 명시되어 있지 않고, 오로지 삼겹살을 굽는데 필요한 정보만을 명시하고 있습니다.
 
 이제 간단한 기본 개념이 끝났습니다. 다음부터는 RxSwift에 대해서 하나씩 알아가 보도록 합시다.
 
 [Next](RxSwift%20Components)
 */
